// Найти минимум и максимум

Console.WriteLine("Введите первое число:") ;
int num1 = int.Parse (Console.ReadLine() ) ;
Console.WriteLine("Введите второе число:") ;
int num2 = int.Parse (Console.ReadLine () ) ;
if (num1>num2) {
    Console.WriteLine("Максимальное число") ;
    Console.WriteLine(num1) ;
    Console.WriteLine("Минимальное число: ") ;
    Console.WriteLine(num2) ; }
    else {
    Console.WriteLine("Максимальное число") ;
    Console.WriteLine(num2) ;
    Console.WriteLine("Минимальное число: ") ;
    Console.WriteLine(num1) ; } 

